fg_faculty/app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors" WHERE (Name LIKE '%Li%' OR Nationality LIKE '%Li%' OR Department LIKE '%Li%' OR Personal_Statement LIKE '%Li%') ORDER BY created_at DESC
---
  def index
    @professors = Professor.all

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @professor = Professor.find(params[:id])

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @professor = Professor.find(params[:id])

INSERT INTO "professors" ("Name", "Email", "Office", "Department", "Phone_Number", "Personal_Statement", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "Nationality") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @professor = Professor.new(professor_params)

    if @professor.save

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "professors" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["image_file_name", "Harrison_Chotzen_-_Headshot.png"], ["image_file_size", 66196], ["image_updated_at", "2018-04-10 23:36:18.530611"], ["updated_at", "2018-04-10 23:36:18.877021"], ["id", 34]]
---
  def update
    @professor = Professor.find(params[:id])

    if @professor.update(professor_params)

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 20]]
---
  def destroy
    @professor = Professor.find(params[:id])
    @professor.destroy